Revit 2027 API
SchemaCommon Class
 A static class that provides access to the property names that appear in all the visual Asset types.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Visual.SchemaCommon
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static class SchemaCommon
Public NotInheritable Class SchemaCommon
public ref class SchemaCommon abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
type SchemaCommon = class end
The SchemaCommon type exposes the following members.
Properties
Name | Description
BaseSchema |  The property labeled "BaseSchema" common to all visual Asset types.
Category |  The property labeled "Category" common to all visual Asset types.
Description |  The property labeled "Description" common to all visual Asset types.
Hidden |  The property labeled "Hidden" common to all visual Asset types.
Keyword |  The property labeled "Keyword" common to all visual Asset types.
Thumbnail |  The property labeled "Thumbnail" common to all visual Asset types.
UIName |  The property labeled "UIName" common to all visual Asset types.
VersionGUID |  The property labeled "VersionGUID" common to all visual Asset types.
Top
See Also
Reference
Autodesk.Revit.DB.Visual Namespace